# Gözlem ve Değişken Seçimi : loc & iloc

In [2]:
import numpy as np
import pandas as pd
m = np.random.randint(1,30, size = (10,3))
df = pd.DataFrame(m,columns = ["var1","var2","var3"])
df

   var1  var2  var3
0    19     3    12
1    20    18    18
2    15    19     8
3    22     8    20
4     6    29     7
5     4     6    21
6    26    19     3
7    14    21    11
8    22    18     5
9     1    14    22

In [3]:
#loc : tanımlandığı sekli ile secim yapmak için kullanılır

In [4]:
df.loc[0:3]

   var1  var2  var3
0    19     3    12
1    20    18    18
2    15    19     8
3    22     8    20

In [5]:
# iloc : Alışık olduğumuz indexleme mantığıyla seçim yapar.

In [6]:
df.iloc[0:3]

   var1  var2  var3
0    19     3    12
1    20    18    18
2    15    19     8

In [7]:
df.iloc[0,0]

19

In [8]:
df.iloc[:3,:2]

   var1  var2
0    19     3
1    20    18
2    15    19

In [9]:
df.loc[0:3,"var3"]

0    12
1    18
2     8
3    20
Name: var3, dtype: int32

In [12]:
df.iloc[0:3]["var3"]

0    12
1    18
2     8
Name: var3, dtype: int32

In [14]:
df["var1"]

0    19
1    20
2    15
3    22
4     6
5     4
6    26
7    14
8    22
9     1
Name: var1, dtype: int32

In [15]:
df[0:2][["var1","var2"]]

   var1  var2
0    19     3
1    20    18

In [20]:
df[df.var1 > 15]

   var1  var2  var3
0    19     3    12
1    20    18    18
3    22     8    20
6    26    19     3
8    22    18     5

In [21]:
df[(df.var1>15) & (df.var3 < 5)]

   var1  var2  var3
6    26    19     3

In [22]:
df.loc[(df.var1>15), ["var1","var2"]]

   var1  var2
0    19     3
1    20    18
3    22     8
6    26    19
8    22    18

In [23]:
df[(df.var1>15)][["var1","var2"]]

   var1  var2
0    19     3
1    20    18
3    22     8
6    26    19
8    22    18